УТ/src/DataProcessors/ПодписаниеДанныхВМобильномЭДО/ПодписаниеДанныхВМобильномЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодписаниеДанныхВМобильномЭДО</name>
  <attributes>
    <name>Подписант</name>
    <type>
      <types>CatalogRef.ПодписантыСервисаМобильнойПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМобильнойПодписи</name>
    <type>
      <types>EnumRef.ВидыМобильныхПодписей</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ/src/DataProcessors/ПодписаниеДанныхВМобильномЭДО/Forms/ФормаПодписанияСоглашенияНаЗагрузкуСертификата/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

// Код процедур и функций
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ИнтеграцияБСПБЭД.ДоступноИспользованиеСервисовМобильногоПодписания() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.Подписант.ТолькоПросмотр = Параметры.Свойство("Подписант", Объект.Подписант);
	
	Параметры.Свойство("ВидМобильнойПодписи", Объект.ВидМобильнойПодписи);

	ТекущаяВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	Если Объект.ВидМобильнойПодписи = Перечисления.ВидыМобильныхПодписей.МояПодпись Тогда
	
		СоглашениеНаЗагрузкуСертификата =
			Обработки.ПодписаниеДанныхВМобильномЭДО.ПолучитьМакет("СоглашениеНаЗагрузкуСертификатаСервисаМояПодпись");
		
		Элементы.СтраницыПодписанияСоглашения.ТекущаяСтраница = Элементы.СтраницаИнформацияОПодписанииСоглашенияМояПодпись;

	ИначеЕсли Объект.ВидМобильнойПодписи = Перечисления.ВидыМобильныхПодписей.ГосключУКЭП Или
		Объект.ВидМобильнойПодписи = Перечисления.ВидыМобильныхПодписей.ГосключУКЭП Тогда

		СоглашениеНаЗагрузкуСертификата =
			Обработки.ПодписаниеДанныхВМобильномЭДО.ПолучитьМакет("СоглашениеНаЗагрузкуСертификатаСервисаГосКлюч");
		
		Элементы.СтраницыПодписанияСоглашения.ТекущаяСтраница = Элементы.СтраницаИнформацияОПодписанииСоглашенияГосключ;
	
	КонецЕсли;

	ДоступноИспользованиеСервисовМобильногоПодписания = ИнтеграцияБСПБЭД.ДоступноИспользованиеСервисовМобильногоПодписания();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций
&НаКлиенте
Асинх Процедура Подписать(Команда)
	
	Если Не ДоступноИспользованиеСервисовМобильногоПодписания Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Сервисы мобильного подписания не доступны'"));
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура();
	СтруктураПредставления = Новый Структура();
	СтруктураПредставления.Вставить("Представление", НСтр("ru = 'Соглашение на загрузку сертификата'"));
	СтруктураПредставления.Вставить("ИмяФайла", НСтр("ru = 'Соглашение на загрузку сертификата.txt'"));

	ОписаниеДанных.Вставить("Представление", СтруктураПредставления);
	ОписаниеДанных.Вставить("Данные", ПолучитьДвоичныеДанныеИзСтроки(СоглашениеНаЗагрузкуСертификата.ПолучитьТекст()));
	
	ОписаниеДанных.Вставить("ПодписаниеВЭтомПриложении", Ложь);
	
	ПараметрыПодписанта = ИнтеграцияБСПБЭДВызовСервера.ПараметрыПодписантаМобильнойПодписи(Объект.Подписант);
	
	ОписаниеДанных.Вставить("ВыбранныйПодписант", ПараметрыПодписанта);

	ПараметрыВыполнения = Новый Структура("ОписаниеДанных, ИдентификаторФормы, Форма",
		ОписаниеДанных,
		УникальныйИдентификатор,
		ЭтотОбъект);
	
	КонтекстПодписания = Новый Структура("ПараметрыВыполнения, Подписант, ИдентификаторФормы",
		ПараметрыВыполнения,
		ПараметрыПодписанта,
		УникальныйИдентификатор);
		
	ПараметрыПодписания = СервисМобильнойПодписиКлиентСервер.ПараметрыПодписания();
	ПараметрыПодписания.ПакетнаяОтправкаНаПодписание = Ложь;
	ПараметрыПодписания.ВидМобильнойПодписи = Объект.ВидМобильнойПодписи;
	
	ПараметрыПодписания.Вставить("ТекущаяВерсияБСП", ТекущаяВерсияБСП);
	
	ПодписатьЗавершение = Новый ОписаниеОповещения("ПодписатьЗавершение", ЭтотОбъект, КонтекстПодписания);
	
	ИнтеграцияБСПБЭДСлужебныйКлиент.ПодписатьДанныеВСервисеМобильнойПодписи(ПодписатьЗавершение,
		КонтекстПодписания,
		ПараметрыПодписания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодписатьЗавершение(Результат, Контекст) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Или Результат.Свойство("ОтменаПодписания") Тогда
		Возврат;
	КонецЕсли;

	Ошибка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Ошибка");
	Если Ошибка <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);
		Возврат;
	КонецЕсли;

	ОписаниеДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст.ПараметрыВыполнения, "ОписаниеДанных");
	
	Если ОписаниеДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СертификатПодписанта = КриптографияБЭДСлужебныйКлиент.НайтиСоздатьСертификатПодписантаИзСвойствПодписи(
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеДанных, "СвойстваПодписи"),
		Объект.Подписант,
		Объект.ВидМобильнойПодписи);
	
	Закрыть(СертификатПодписанта);
	
КонецПроцедуры

#КонецОбласти
